Linnnnnn666/evo-firmware/oled-display/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# 保守 flash 组合（经验库：劣质 flash 兼容），与烧录板/board-template 一致
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
# N16R8 板：启用 8MB Octal PSRAM（与 v1.6.1 一致，避免启动异常）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
